The path type of the link (relative, absolute, or server).
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2012
 Syntax
  C#
public PathType PathType { get; }
  Visual Basic
Public ReadOnly Property PathType As PathType
	Get
  Visual C++
public:
property PathType PathType {
	PathType get ();
}
 See Also
  ExternalFileReference Class
  Autodesk.Revit.DB Namespace